# 🍺 All available Homebrew packages can be searched here: https://formulae.brew.sh
# 🍏 Mac App Store apps (and their IDs) can be searched via `mas search <search-term>`
# 🚨 Prefer casks (🍺) over MAS apps (🍏) because cask installs work more reliably!

# system management
tap "nohype-ai/macstack"
brew "nohype-ai/macstack/macstack"
cask "applite" # GUI app Homebrew wrapper
cask "omnidisksweeper" # simple free disk usage inspection (give it full disk access in System Settings > Privacy & Security)
cask "stats" # system health monitor, including chip temperature

# communication, browser
cask "WhatsApp"
cask "brave-browser" # PWAs can block ads on YT (-Music), but Brave wastes main memory
mas "AdGuard Mini: Safari Adblock", id: 1440147259 # block ads in Safari, not on YT (-Music)
mas "Noir – Dark Mode for Safari", id: 1592917505 # force dark mode on websites in Safari

# writing, diagramming, office
cask "typora"
cask "texifier" # LaTeX editor
mas "Pages: Create Documents", id: 361309726
mas "Numbers: Make Spreadsheets", id: 361304891
mas "Keynote: Design Presentations", id: 361285480
cask "omnigraffle"
cask "inkscape" # vector graphics app and cli (also for eps to svg conversion)

# basic productivity tools
cask "raycast"                 # THE macOS swiss army knife for productivity
cask "focus"                   # limit distractions, heyfocus.com

# basic developer tools
brew "zsh"                     # but use this script shebang: #!/usr/bin/env zssh
brew "git"                     # just so it gets updated frequently
cask "fork"                    # graphical git client
cask "font-fira-code"          # monospaced font with coding ligatures
cask "ghostty"                 # modern native macOS terminal app
brew "msedit"                  # lightweight TUI editor by Microsoft

# (Coding-) Agents and Lean IDEs
cask "zed"                     # https://zed.dev, lean and fast IDE
cask "opencode-desktop"        # https://opencode.ai/download
brew "opencode"                # https://opencode.ai
cask "claude"                  # https://code.claude.com/docs/en/desktop-quickstart
cask "claude-code"             # https://claude.com/product/claude-code
cask "cursor-cli"              # https://cursor.com/cli
brew "gemini-cli"              # https://geminicli.com
#cask "openclaw"  install seems broken currently
#brew "openclaw-cli"           # https://openclaw.ai

# Bloated VS Code Based IDEs
#cask "cursor"                  # https://cursor.com
#cask "antigravity"             # https://antigravity.google.com
#cask "windsurf"                # https://windsurf.com/
#cask "kiro"                    # https://kiro.dev
#vscode "mathematic.vscode-pdf" # fast maintained PDF viewer (for Antigravity use https://open-vsx.org/extension/mathematic/vscode-pdf)

# Run Local Models
brew "ollama"

# Apple development
brew "xcodes"
cask "xcodes-app"
cask "sf-symbols" # https://developer.apple.com/sf-symbols
#mas "TestFlight", id: 899247664 # mas install fails: would require sudo since it copies the receipt file in a second step
mas "Developer", id: 640199958
mas "Icon Generator", id: 1631880470 # for scaling macOS app icons

# Apple fonts: https://developer.apple.com/fonts
cask "font-sf-pro"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-new-york"

# Python development
brew "uv" # THE python eco system manager, https://github.com/astral-sh/uv
vscode "ms-python.python" # Central extension for python

# Screen recording (for demos and lectures) and media
mas "Hand Mirror", id: 1502839586 # video overlay in lecture recordings
cask "keycastr" # key strokes overlay in lecture recordings
cask "obs" # screen recording that can capture system audio
cask "handbrake-app" # video transcoder for compressing screen recordings
cask "adapter" # converting video, audio and images

# CLI tools for working with content file formats (for scripts/agents)
brew "imagemagick" # working with images (scale, crop, convert format ...)
brew "ghostscript" # pdf support for imagemagick (which does not install gs)
brew "pandoc" # universal document converter (markdown, HTML, LaTeX, docx, PDF ...)
brew "weasyprint" # specialized HTML/CSS to PDF converter, preserves styling
brew "ffmpeg" # industry-standard CLI video/audio converter/compressor/processor
brew "woff2" # font conversion (e.g. .otf/.ttf -> .woff2)

# Networking / Cloud / DevOps
cask "radio-silence"   # firewall & network monitor
#brew "tailscale"       # business VPN: easy/secure/fast remote access (ZTNA)
#cask "tailscale-app"
#cask "docker-desktop"  # "Docker Desktop" app plus `docker` CLI

# ⚠️ Required dependencies for Brewfile (do not remove)
brew "mas" # for declaring mac app store apps
cask "visual-studio-code" # for declaring vs code extensions
